app/controllers/students_controller.rb

INSERT INTO "students" ("first_name", "last_name", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["first_name", "Bill"], ["last_name", "Smith"], ["created_at", "2017-12-26 16:20:44.127977"], ["updated_at", "2017-12-26 16:20:44.127977"]]
---
  def create
    @student = Student.create()

SELECT  "students".* FROM "students" WHERE "students"."id" = ? LIMIT 1  [["id", 1]]
---
  def update
    @student = Student.find(params[:id])